1. Write a function named is_vowel. It should accept a string as input and use a regular expression to determine if the passed string is a vowel. While not explicity mentioned in the lesson, you can treat the result of re.search as a boolean value that indicates whether or not the regular expression matches the given string.

In [1]:
import pandas as pd
import numpy as np
import re

In [26]:
def is_vowel(string):
    return bool(re.search(r'^[aeiouAEIOU]$', string))

In [28]:
is_vowel('aaa')

False

2. Write a function named is_valid_username that accepts a string as input. A valid username starts with a lowercase letter, and only consists of lowercase letters, numbers, or the _ character. It should also be no longer than 32 characters. The function should return either True or False depending on whether the passed string is a valid username.

In [19]:
# starts with a lowercase letter
# is only lowercase letters, numbers, or _
# should be no longer than 32 characters
# return a boolean

def is_valid_username(string):
    regexp = r'^[a-z][a-z0-9_]{,31}$'
    return bool(re.search(regexp, string))

In [24]:
is_valid_username('codeup_train') == True

True

In [21]:
is_valid_username('1codeup') == True

False

In [22]:
is_valid_username('2Codeup') == True

False

3. Write a regular expression to capture phone numbers.

- (210) 867 5309
- +1 210.867.5309
- 867-5309
- 210-867-5309

In [25]:
# Seven digits w/ no other characters
re.search(r'\d{7}', '1234567')

In [29]:
# Match 3 digits then a hyphen, then 4 digits
re.search(r'\d{3}-\d{4}', '123-1234')

In [33]:
# 3 digits then -, ., or ' ' then 4 digits
re.search(r"\d{3}[-. ]\d{4}", '123-1234')

In [37]:
# Using \D for any non-digit
re.search(r"\d{3}\D?\d{4}", '123 4567')

In [44]:
re.search(r"\(?\d{3}\)?.?\d{3}.?\d{4}", "210-867-5309")

In [47]:
re.search(r"(\+?\d+)?.?(\(?\d{3}\)?)?.?\d{3}.?\d{4}", "(210) 867 5309")

In [48]:
# Alternative method using DF
phone_regex = re.compile(
'''
^
(?P<country_code>\+\d+)?\D*?
(?P<area_code>\d{3})?\D*?
(?P<exchange_code>\d{3})\D*?
(?P<line_number>\d{4})
''', re.VERBOSE
)

In [49]:
df = pd.DataFrame()
df['number'] = [
    '(210) 867 5309',
    '+1 210.867.5309', 
    '867-5309',
    '210-867-5309', 
    '2108675309',
]

In [50]:
# Extract turns named capture groups into dataframe columns
# NaNs for no match
df.number.str.extract(phone_regex)

  country_code area_code exchange_code line_number
0          NaN       210           867        5309
1           +1       210           867        5309
2          NaN       NaN           867        5309
3          NaN       210           867        5309
4          NaN       210           867        5309

In [51]:
df = pd.concat([df, df.number.str.extract(phone_regex)], axis=1)

In [52]:
df

            number country_code area_code exchange_code line_number
0   (210) 867 5309          NaN       210           867        5309
1  +1 210.867.5309           +1       210           867        5309
2         867-5309          NaN       NaN           867        5309
3     210-867-5309          NaN       210           867        5309
4       2108675309          NaN       210           867        5309

4. Use regular expressions to convert the dates below to the standardized year-month-day format.

In [53]:
dates = [
    "02/04/19",
    "02/05/19",
    "02/06/19",
    "02/07/19",
    "02/08/19",
    "02/09/19",
    "02/10/19"
]

In [54]:
df = pd.DataFrame({'original': dates})

In [55]:
regexp = re.compile(r'''
(?P<month>\d{2})/
(?P<day>\d{2})/
(?P<year>\d{2})
''', re.VERBOSE)

In [57]:
df = pd.concat([df, df.original.str.extract(regexp)], axis=1)

In [58]:
df['new_format'] = df.year + '/' + df.month + '/' + df.day

In [59]:
df

   original month day year new_format
0  02/04/19    02  04   19   19/02/04
1  02/05/19    02  05   19   19/02/05
2  02/06/19    02  06   19   19/02/06
3  02/07/19    02  07   19   19/02/07
4  02/08/19    02  08   19   19/02/08
5  02/09/19    02  09   19   19/02/09
6  02/10/19    02  10   19   19/02/10